/* automatically generated by rust-bindgen 0.63.0 */

pub type rosidl_message_typesupport_handle_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_message_type_support_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const rosidl_message_type_support_t,
>;
#[repr(C)]
#[derive(Debug)]
pub struct unique_identifier_msgs__msg__UUID {
    pub uuid: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_unique_identifier_msgs__msg__UUID() {
    const UNINIT: ::std::mem::MaybeUninit<unique_identifier_msgs__msg__UUID> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<unique_identifier_msgs__msg__UUID>(),
        16usize,
        concat!("Size of: ", stringify!(unique_identifier_msgs__msg__UUID))
    );
    assert_eq!(
        ::std::mem::align_of::<unique_identifier_msgs__msg__UUID>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(unique_identifier_msgs__msg__UUID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uuid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(unique_identifier_msgs__msg__UUID),
            "::",
            stringify!(uuid)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct unique_identifier_msgs__msg__UUID__Sequence {
    pub data: *mut unique_identifier_msgs__msg__UUID,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_unique_identifier_msgs__msg__UUID__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<unique_identifier_msgs__msg__UUID__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<unique_identifier_msgs__msg__UUID__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(unique_identifier_msgs__msg__UUID__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<unique_identifier_msgs__msg__UUID__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(unique_identifier_msgs__msg__UUID__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(unique_identifier_msgs__msg__UUID__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(unique_identifier_msgs__msg__UUID__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(unique_identifier_msgs__msg__UUID__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct builtin_interfaces__msg__Time {
    pub sec: i32,
    pub nanosec: u32,
}
#[test]
fn bindgen_test_layout_builtin_interfaces__msg__Time() {
    const UNINIT: ::std::mem::MaybeUninit<builtin_interfaces__msg__Time> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<builtin_interfaces__msg__Time>(),
        8usize,
        concat!("Size of: ", stringify!(builtin_interfaces__msg__Time))
    );
    assert_eq!(
        ::std::mem::align_of::<builtin_interfaces__msg__Time>(),
        4usize,
        concat!("Alignment of ", stringify!(builtin_interfaces__msg__Time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nanosec) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time),
            "::",
            stringify!(nanosec)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct builtin_interfaces__msg__Time__Sequence {
    pub data: *mut builtin_interfaces__msg__Time,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_builtin_interfaces__msg__Time__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<builtin_interfaces__msg__Time__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<builtin_interfaces__msg__Time__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(builtin_interfaces__msg__Time__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<builtin_interfaces__msg__Time__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(builtin_interfaces__msg__Time__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__msg__GoalInfo {
    pub goal_id: unique_identifier_msgs__msg__UUID,
    pub stamp: builtin_interfaces__msg__Time,
}
#[test]
fn bindgen_test_layout_action_msgs__msg__GoalInfo() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__msg__GoalInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__msg__GoalInfo>(),
        24usize,
        concat!("Size of: ", stringify!(action_msgs__msg__GoalInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__msg__GoalInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(action_msgs__msg__GoalInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).goal_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalInfo),
            "::",
            stringify!(goal_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalInfo),
            "::",
            stringify!(stamp)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__msg__GoalInfo__Sequence {
    pub data: *mut action_msgs__msg__GoalInfo,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_action_msgs__msg__GoalInfo__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__msg__GoalInfo__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__msg__GoalInfo__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(action_msgs__msg__GoalInfo__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__msg__GoalInfo__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(action_msgs__msg__GoalInfo__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalInfo__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalInfo__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalInfo__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub const action_msgs__msg__GoalStatus__STATUS_UNKNOWN: _bindgen_ty_1 =
    _bindgen_ty_1::action_msgs__msg__GoalStatus__STATUS_UNKNOWN;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_1 {
    action_msgs__msg__GoalStatus__STATUS_UNKNOWN = 0,
}
pub const action_msgs__msg__GoalStatus__STATUS_ACCEPTED: _bindgen_ty_2 =
    _bindgen_ty_2::action_msgs__msg__GoalStatus__STATUS_ACCEPTED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_2 {
    action_msgs__msg__GoalStatus__STATUS_ACCEPTED = 1,
}
pub const action_msgs__msg__GoalStatus__STATUS_EXECUTING: _bindgen_ty_3 =
    _bindgen_ty_3::action_msgs__msg__GoalStatus__STATUS_EXECUTING;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_3 {
    action_msgs__msg__GoalStatus__STATUS_EXECUTING = 2,
}
pub const action_msgs__msg__GoalStatus__STATUS_CANCELING: _bindgen_ty_4 =
    _bindgen_ty_4::action_msgs__msg__GoalStatus__STATUS_CANCELING;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_4 {
    action_msgs__msg__GoalStatus__STATUS_CANCELING = 3,
}
pub const action_msgs__msg__GoalStatus__STATUS_SUCCEEDED: _bindgen_ty_5 =
    _bindgen_ty_5::action_msgs__msg__GoalStatus__STATUS_SUCCEEDED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_5 {
    action_msgs__msg__GoalStatus__STATUS_SUCCEEDED = 4,
}
pub const action_msgs__msg__GoalStatus__STATUS_CANCELED: _bindgen_ty_6 =
    _bindgen_ty_6::action_msgs__msg__GoalStatus__STATUS_CANCELED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_6 {
    action_msgs__msg__GoalStatus__STATUS_CANCELED = 5,
}
pub const action_msgs__msg__GoalStatus__STATUS_ABORTED: _bindgen_ty_7 =
    _bindgen_ty_7::action_msgs__msg__GoalStatus__STATUS_ABORTED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_7 {
    action_msgs__msg__GoalStatus__STATUS_ABORTED = 6,
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__msg__GoalStatus {
    pub goal_info: action_msgs__msg__GoalInfo,
    pub status: i8,
}
#[test]
fn bindgen_test_layout_action_msgs__msg__GoalStatus() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__msg__GoalStatus> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__msg__GoalStatus>(),
        28usize,
        concat!("Size of: ", stringify!(action_msgs__msg__GoalStatus))
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__msg__GoalStatus>(),
        4usize,
        concat!("Alignment of ", stringify!(action_msgs__msg__GoalStatus))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).goal_info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatus),
            "::",
            stringify!(goal_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatus),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__msg__GoalStatus__Sequence {
    pub data: *mut action_msgs__msg__GoalStatus,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_action_msgs__msg__GoalStatus__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__msg__GoalStatus__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__msg__GoalStatus__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(action_msgs__msg__GoalStatus__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__msg__GoalStatus__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(action_msgs__msg__GoalStatus__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatus__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatus__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatus__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__msg__GoalStatusArray {
    pub status_list: action_msgs__msg__GoalStatus__Sequence,
}
#[test]
fn bindgen_test_layout_action_msgs__msg__GoalStatusArray() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__msg__GoalStatusArray> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__msg__GoalStatusArray>(),
        24usize,
        concat!("Size of: ", stringify!(action_msgs__msg__GoalStatusArray))
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__msg__GoalStatusArray>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(action_msgs__msg__GoalStatusArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status_list) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatusArray),
            "::",
            stringify!(status_list)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__msg__GoalStatusArray__Sequence {
    pub data: *mut action_msgs__msg__GoalStatusArray,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_action_msgs__msg__GoalStatusArray__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__msg__GoalStatusArray__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__msg__GoalStatusArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(action_msgs__msg__GoalStatusArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__msg__GoalStatusArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(action_msgs__msg__GoalStatusArray__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatusArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatusArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__msg__GoalStatusArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__srv__CancelGoal_Request {
    pub goal_info: action_msgs__msg__GoalInfo,
}
#[test]
fn bindgen_test_layout_action_msgs__srv__CancelGoal_Request() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__srv__CancelGoal_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__srv__CancelGoal_Request>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(action_msgs__srv__CancelGoal_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__srv__CancelGoal_Request>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(action_msgs__srv__CancelGoal_Request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).goal_info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Request),
            "::",
            stringify!(goal_info)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__srv__CancelGoal_Request__Sequence {
    pub data: *mut action_msgs__srv__CancelGoal_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_action_msgs__srv__CancelGoal_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__srv__CancelGoal_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__srv__CancelGoal_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(action_msgs__srv__CancelGoal_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__srv__CancelGoal_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(action_msgs__srv__CancelGoal_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub const action_msgs__srv__CancelGoal_Response__ERROR_NONE: _bindgen_ty_8 =
    _bindgen_ty_8::action_msgs__srv__CancelGoal_Response__ERROR_NONE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_8 {
    action_msgs__srv__CancelGoal_Response__ERROR_NONE = 0,
}
pub const action_msgs__srv__CancelGoal_Response__ERROR_REJECTED: _bindgen_ty_9 =
    _bindgen_ty_9::action_msgs__srv__CancelGoal_Response__ERROR_REJECTED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_9 {
    action_msgs__srv__CancelGoal_Response__ERROR_REJECTED = 1,
}
pub const action_msgs__srv__CancelGoal_Response__ERROR_UNKNOWN_GOAL_ID: _bindgen_ty_10 =
    _bindgen_ty_10::action_msgs__srv__CancelGoal_Response__ERROR_UNKNOWN_GOAL_ID;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_10 {
    action_msgs__srv__CancelGoal_Response__ERROR_UNKNOWN_GOAL_ID = 2,
}
pub const action_msgs__srv__CancelGoal_Response__ERROR_GOAL_TERMINATED: _bindgen_ty_11 =
    _bindgen_ty_11::action_msgs__srv__CancelGoal_Response__ERROR_GOAL_TERMINATED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_11 {
    action_msgs__srv__CancelGoal_Response__ERROR_GOAL_TERMINATED = 3,
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__srv__CancelGoal_Response {
    pub return_code: i8,
    pub goals_canceling: action_msgs__msg__GoalInfo__Sequence,
}
#[test]
fn bindgen_test_layout_action_msgs__srv__CancelGoal_Response() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__srv__CancelGoal_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__srv__CancelGoal_Response>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(action_msgs__srv__CancelGoal_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__srv__CancelGoal_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(action_msgs__srv__CancelGoal_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_code) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Response),
            "::",
            stringify!(return_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).goals_canceling) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Response),
            "::",
            stringify!(goals_canceling)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct action_msgs__srv__CancelGoal_Response__Sequence {
    pub data: *mut action_msgs__srv__CancelGoal_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_action_msgs__srv__CancelGoal_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<action_msgs__srv__CancelGoal_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<action_msgs__srv__CancelGoal_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(action_msgs__srv__CancelGoal_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<action_msgs__srv__CancelGoal_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(action_msgs__srv__CancelGoal_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(action_msgs__srv__CancelGoal_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub type rosidl_service_typesupport_handle_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_service_type_support_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const rosidl_service_type_support_t,
>;
#[repr(C)]
#[derive(Debug)]
pub struct builtin_interfaces__msg__Duration {
    pub sec: i32,
    pub nanosec: u32,
}
#[test]
fn bindgen_test_layout_builtin_interfaces__msg__Duration() {
    const UNINIT: ::std::mem::MaybeUninit<builtin_interfaces__msg__Duration> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<builtin_interfaces__msg__Duration>(),
        8usize,
        concat!("Size of: ", stringify!(builtin_interfaces__msg__Duration))
    );
    assert_eq!(
        ::std::mem::align_of::<builtin_interfaces__msg__Duration>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(builtin_interfaces__msg__Duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Duration),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nanosec) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Duration),
            "::",
            stringify!(nanosec)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct builtin_interfaces__msg__Duration__Sequence {
    pub data: *mut builtin_interfaces__msg__Duration,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_builtin_interfaces__msg__Duration__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<builtin_interfaces__msg__Duration__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<builtin_interfaces__msg__Duration__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(builtin_interfaces__msg__Duration__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<builtin_interfaces__msg__Duration__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(builtin_interfaces__msg__Duration__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Duration__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Duration__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Duration__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct std_msgs__msg__Header {
    pub stamp: builtin_interfaces__msg__Time,
    pub frame_id: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Header() {
    const UNINIT: ::std::mem::MaybeUninit<std_msgs__msg__Header> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Header>(),
        32usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Header))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Header>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header),
            "::",
            stringify!(stamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header),
            "::",
            stringify!(frame_id)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_msgs__msg__Header__Sequence {
    pub data: *mut std_msgs__msg__Header,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Header__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<std_msgs__msg__Header__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Header__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Header__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Header__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Header__Sequence))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub const diagnostic_msgs__msg__DiagnosticStatus__OK: _bindgen_ty_12 =
    _bindgen_ty_12::diagnostic_msgs__msg__DiagnosticStatus__OK;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_12 {
    diagnostic_msgs__msg__DiagnosticStatus__OK = 0,
}
pub const diagnostic_msgs__msg__DiagnosticStatus__WARN: _bindgen_ty_13 =
    _bindgen_ty_13::diagnostic_msgs__msg__DiagnosticStatus__WARN;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_13 {
    diagnostic_msgs__msg__DiagnosticStatus__WARN = 1,
}
pub const diagnostic_msgs__msg__DiagnosticStatus__ERROR: _bindgen_ty_14 =
    _bindgen_ty_14::diagnostic_msgs__msg__DiagnosticStatus__ERROR;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_14 {
    diagnostic_msgs__msg__DiagnosticStatus__ERROR = 2,
}
pub const diagnostic_msgs__msg__DiagnosticStatus__STALE: _bindgen_ty_15 =
    _bindgen_ty_15::diagnostic_msgs__msg__DiagnosticStatus__STALE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_15 {
    diagnostic_msgs__msg__DiagnosticStatus__STALE = 3,
}
#[repr(C)]
pub struct diagnostic_msgs__msg__KeyValue {
    pub key: rosidl_runtime_c__String,
    pub value: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__msg__KeyValue() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__msg__KeyValue> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__msg__KeyValue>(),
        48usize,
        concat!("Size of: ", stringify!(diagnostic_msgs__msg__KeyValue))
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__msg__KeyValue>(),
        8usize,
        concat!("Alignment of ", stringify!(diagnostic_msgs__msg__KeyValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__KeyValue),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__KeyValue),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct diagnostic_msgs__msg__KeyValue__Sequence {
    pub data: *mut diagnostic_msgs__msg__KeyValue,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__msg__KeyValue__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__msg__KeyValue__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__msg__KeyValue__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__msg__KeyValue__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__msg__KeyValue__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__msg__KeyValue__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__KeyValue__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__KeyValue__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__KeyValue__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct diagnostic_msgs__msg__DiagnosticStatus {
    pub level: u8,
    pub name: rosidl_runtime_c__String,
    pub message: rosidl_runtime_c__String,
    pub hardware_id: rosidl_runtime_c__String,
    pub values: diagnostic_msgs__msg__KeyValue__Sequence,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__msg__DiagnosticStatus() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__msg__DiagnosticStatus> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__msg__DiagnosticStatus>(),
        104usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__msg__DiagnosticStatus>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hardware_id) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus),
            "::",
            stringify!(hardware_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).values) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus),
            "::",
            stringify!(values)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct diagnostic_msgs__msg__DiagnosticStatus__Sequence {
    pub data: *mut diagnostic_msgs__msg__DiagnosticStatus,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__msg__DiagnosticStatus__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__msg__DiagnosticStatus__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__msg__DiagnosticStatus__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__msg__DiagnosticStatus__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticStatus__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct diagnostic_msgs__msg__DiagnosticArray {
    pub header: std_msgs__msg__Header,
    pub status: diagnostic_msgs__msg__DiagnosticStatus__Sequence,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__msg__DiagnosticArray() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__msg__DiagnosticArray> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__msg__DiagnosticArray>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__msg__DiagnosticArray>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct diagnostic_msgs__msg__DiagnosticArray__Sequence {
    pub data: *mut diagnostic_msgs__msg__DiagnosticArray,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__msg__DiagnosticArray__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__msg__DiagnosticArray__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__msg__DiagnosticArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__msg__DiagnosticArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__msg__DiagnosticArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct diagnostic_msgs__srv__AddDiagnostics_Request {
    pub load_namespace: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__srv__AddDiagnostics_Request() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__srv__AddDiagnostics_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__srv__AddDiagnostics_Request>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__srv__AddDiagnostics_Request>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).load_namespace) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Request),
            "::",
            stringify!(load_namespace)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct diagnostic_msgs__srv__AddDiagnostics_Request__Sequence {
    pub data: *mut diagnostic_msgs__srv__AddDiagnostics_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__srv__AddDiagnostics_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__srv__AddDiagnostics_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__srv__AddDiagnostics_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__srv__AddDiagnostics_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct diagnostic_msgs__srv__AddDiagnostics_Response {
    pub success: bool,
    pub message: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__srv__AddDiagnostics_Response() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__srv__AddDiagnostics_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__srv__AddDiagnostics_Response>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__srv__AddDiagnostics_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).success) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response),
            "::",
            stringify!(success)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response),
            "::",
            stringify!(message)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct diagnostic_msgs__srv__AddDiagnostics_Response__Sequence {
    pub data: *mut diagnostic_msgs__srv__AddDiagnostics_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__srv__AddDiagnostics_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__srv__AddDiagnostics_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__srv__AddDiagnostics_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__srv__AddDiagnostics_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__AddDiagnostics_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct diagnostic_msgs__srv__SelfTest_Request {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__srv__SelfTest_Request() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__srv__SelfTest_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__srv__SelfTest_Request>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__srv__SelfTest_Request>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__srv__SelfTest_Request)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Request),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct diagnostic_msgs__srv__SelfTest_Request__Sequence {
    pub data: *mut diagnostic_msgs__srv__SelfTest_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__srv__SelfTest_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__srv__SelfTest_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__srv__SelfTest_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__srv__SelfTest_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__srv__SelfTest_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct diagnostic_msgs__srv__SelfTest_Response {
    pub id: rosidl_runtime_c__String,
    pub passed: u8,
    pub status: diagnostic_msgs__msg__DiagnosticStatus__Sequence,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__srv__SelfTest_Response() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__srv__SelfTest_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__srv__SelfTest_Response>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__srv__SelfTest_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).passed) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response),
            "::",
            stringify!(passed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct diagnostic_msgs__srv__SelfTest_Response__Sequence {
    pub data: *mut diagnostic_msgs__srv__SelfTest_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_diagnostic_msgs__srv__SelfTest_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<diagnostic_msgs__srv__SelfTest_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<diagnostic_msgs__srv__SelfTest_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<diagnostic_msgs__srv__SelfTest_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(diagnostic_msgs__srv__SelfTest_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Vector3 {
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Vector3() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Vector3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Vector3>(),
        24usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Vector3))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Vector3>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Vector3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Vector3__Sequence {
    pub data: *mut geometry_msgs__msg__Vector3,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Vector3__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Vector3__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Vector3__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Vector3__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Vector3__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Vector3__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Accel {
    pub linear: geometry_msgs__msg__Vector3,
    pub angular: geometry_msgs__msg__Vector3,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Accel() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Accel> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Accel>(),
        48usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Accel))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Accel>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Accel))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Accel),
            "::",
            stringify!(linear)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angular) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Accel),
            "::",
            stringify!(angular)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Accel__Sequence {
    pub data: *mut geometry_msgs__msg__Accel,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Accel__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Accel__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Accel__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Accel__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Accel__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Accel__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Accel__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Accel__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Accel__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__AccelStamped {
    pub header: std_msgs__msg__Header,
    pub accel: geometry_msgs__msg__Accel,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__AccelStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__AccelStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__AccelStamped>(),
        80usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__AccelStamped))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__AccelStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__AccelStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accel) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelStamped),
            "::",
            stringify!(accel)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__AccelStamped__Sequence {
    pub data: *mut geometry_msgs__msg__AccelStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__AccelStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__AccelStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__AccelStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__AccelStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__AccelStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__AccelStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__AccelWithCovariance {
    pub accel: geometry_msgs__msg__Accel,
    pub covariance: [f64; 36usize],
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__AccelWithCovariance() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__AccelWithCovariance> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__AccelWithCovariance>(),
        336usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__AccelWithCovariance)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__AccelWithCovariance>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__AccelWithCovariance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovariance),
            "::",
            stringify!(accel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).covariance) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovariance),
            "::",
            stringify!(covariance)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__AccelWithCovariance__Sequence {
    pub data: *mut geometry_msgs__msg__AccelWithCovariance,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__AccelWithCovariance__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__AccelWithCovariance__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__AccelWithCovariance__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__AccelWithCovariance__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__AccelWithCovariance__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__AccelWithCovariance__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovariance__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovariance__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovariance__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__AccelWithCovarianceStamped {
    pub header: std_msgs__msg__Header,
    pub accel: geometry_msgs__msg__AccelWithCovariance,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__AccelWithCovarianceStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__AccelWithCovarianceStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__AccelWithCovarianceStamped>(),
        368usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__AccelWithCovarianceStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accel) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped),
            "::",
            stringify!(accel)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__AccelWithCovarianceStamped__Sequence {
    pub data: *mut geometry_msgs__msg__AccelWithCovarianceStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__AccelWithCovarianceStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<
        geometry_msgs__msg__AccelWithCovarianceStamped__Sequence,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__AccelWithCovarianceStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__AccelWithCovarianceStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__AccelWithCovarianceStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Inertia {
    pub m: f64,
    pub com: geometry_msgs__msg__Vector3,
    pub ixx: f64,
    pub ixy: f64,
    pub ixz: f64,
    pub iyy: f64,
    pub iyz: f64,
    pub izz: f64,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Inertia() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Inertia> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Inertia>(),
        80usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Inertia))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Inertia>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Inertia))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia),
            "::",
            stringify!(m)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).com) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia),
            "::",
            stringify!(com)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ixx) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia),
            "::",
            stringify!(ixx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ixy) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia),
            "::",
            stringify!(ixy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ixz) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia),
            "::",
            stringify!(ixz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iyy) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia),
            "::",
            stringify!(iyy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iyz) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia),
            "::",
            stringify!(iyz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).izz) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia),
            "::",
            stringify!(izz)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Inertia__Sequence {
    pub data: *mut geometry_msgs__msg__Inertia,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Inertia__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Inertia__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Inertia__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Inertia__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Inertia__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Inertia__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Inertia__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__InertiaStamped {
    pub header: std_msgs__msg__Header,
    pub inertia: geometry_msgs__msg__Inertia,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__InertiaStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__InertiaStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__InertiaStamped>(),
        112usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__InertiaStamped))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__InertiaStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__InertiaStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__InertiaStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inertia) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__InertiaStamped),
            "::",
            stringify!(inertia)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__InertiaStamped__Sequence {
    pub data: *mut geometry_msgs__msg__InertiaStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__InertiaStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__InertiaStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__InertiaStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__InertiaStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__InertiaStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__InertiaStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__InertiaStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__InertiaStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__InertiaStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Point {
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Point() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Point> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Point>(),
        24usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Point))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Point>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Point))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Point__Sequence {
    pub data: *mut geometry_msgs__msg__Point,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Point__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Point__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Point__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Point__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Point__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Point__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Point32 {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Point32() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Point32> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Point32>(),
        12usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Point32))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Point32>(),
        4usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Point32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point32),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point32),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point32),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Point32__Sequence {
    pub data: *mut geometry_msgs__msg__Point32,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Point32__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Point32__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Point32__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Point32__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Point32__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Point32__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point32__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point32__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Point32__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__PointStamped {
    pub header: std_msgs__msg__Header,
    pub point: geometry_msgs__msg__Point,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PointStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PointStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PointStamped>(),
        56usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__PointStamped))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PointStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PointStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PointStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).point) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PointStamped),
            "::",
            stringify!(point)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__PointStamped__Sequence {
    pub data: *mut geometry_msgs__msg__PointStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PointStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PointStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PointStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__PointStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PointStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PointStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PointStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PointStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PointStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Polygon {
    pub points: geometry_msgs__msg__Point32__Sequence,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Polygon() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Polygon> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Polygon>(),
        24usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Polygon))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Polygon>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Polygon))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).points) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Polygon),
            "::",
            stringify!(points)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Polygon__Sequence {
    pub data: *mut geometry_msgs__msg__Polygon,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Polygon__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Polygon__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Polygon__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Polygon__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Polygon__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Polygon__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Polygon__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Polygon__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Polygon__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__PolygonStamped {
    pub header: std_msgs__msg__Header,
    pub polygon: geometry_msgs__msg__Polygon,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PolygonStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PolygonStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PolygonStamped>(),
        56usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__PolygonStamped))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PolygonStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PolygonStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PolygonStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).polygon) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PolygonStamped),
            "::",
            stringify!(polygon)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__PolygonStamped__Sequence {
    pub data: *mut geometry_msgs__msg__PolygonStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PolygonStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PolygonStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PolygonStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__PolygonStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PolygonStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PolygonStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PolygonStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PolygonStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PolygonStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Quaternion {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub w: f64,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Quaternion() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Quaternion> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Quaternion>(),
        32usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Quaternion))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Quaternion>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Quaternion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Quaternion),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Quaternion),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Quaternion),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Quaternion),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Quaternion__Sequence {
    pub data: *mut geometry_msgs__msg__Quaternion,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Quaternion__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Quaternion__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Quaternion__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Quaternion__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Quaternion__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Quaternion__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Quaternion__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Quaternion__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Quaternion__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Pose {
    pub position: geometry_msgs__msg__Point,
    pub orientation: geometry_msgs__msg__Quaternion,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Pose() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Pose> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Pose>(),
        56usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Pose))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Pose>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Pose))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).orientation) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose),
            "::",
            stringify!(orientation)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Pose__Sequence {
    pub data: *mut geometry_msgs__msg__Pose,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Pose__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Pose__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Pose__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Pose__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Pose__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Pose__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Pose2D {
    pub x: f64,
    pub y: f64,
    pub theta: f64,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Pose2D() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Pose2D> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Pose2D>(),
        24usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Pose2D))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Pose2D>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Pose2D))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose2D),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose2D),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).theta) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose2D),
            "::",
            stringify!(theta)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Pose2D__Sequence {
    pub data: *mut geometry_msgs__msg__Pose2D,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Pose2D__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Pose2D__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Pose2D__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Pose2D__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Pose2D__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Pose2D__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose2D__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose2D__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Pose2D__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__PoseArray {
    pub header: std_msgs__msg__Header,
    pub poses: geometry_msgs__msg__Pose__Sequence,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PoseArray() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PoseArray> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PoseArray>(),
        56usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__PoseArray))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PoseArray>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__PoseArray))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseArray),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poses) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseArray),
            "::",
            stringify!(poses)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__PoseArray__Sequence {
    pub data: *mut geometry_msgs__msg__PoseArray,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PoseArray__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PoseArray__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PoseArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__PoseArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PoseArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PoseArray__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__PoseStamped {
    pub header: std_msgs__msg__Header,
    pub pose: geometry_msgs__msg__Pose,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PoseStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PoseStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PoseStamped>(),
        88usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__PoseStamped))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PoseStamped>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__PoseStamped))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseStamped),
            "::",
            stringify!(pose)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__PoseStamped__Sequence {
    pub data: *mut geometry_msgs__msg__PoseStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PoseStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PoseStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PoseStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__PoseStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PoseStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PoseStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__PoseWithCovariance {
    pub pose: geometry_msgs__msg__Pose,
    pub covariance: [f64; 36usize],
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PoseWithCovariance() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PoseWithCovariance> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PoseWithCovariance>(),
        344usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__PoseWithCovariance)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PoseWithCovariance>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PoseWithCovariance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovariance),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).covariance) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovariance),
            "::",
            stringify!(covariance)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__PoseWithCovariance__Sequence {
    pub data: *mut geometry_msgs__msg__PoseWithCovariance,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PoseWithCovariance__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PoseWithCovariance__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PoseWithCovariance__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__PoseWithCovariance__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PoseWithCovariance__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PoseWithCovariance__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovariance__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovariance__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovariance__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__PoseWithCovarianceStamped {
    pub header: std_msgs__msg__Header,
    pub pose: geometry_msgs__msg__PoseWithCovariance,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PoseWithCovarianceStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PoseWithCovarianceStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PoseWithCovarianceStamped>(),
        376usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PoseWithCovarianceStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped),
            "::",
            stringify!(pose)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__PoseWithCovarianceStamped__Sequence {
    pub data: *mut geometry_msgs__msg__PoseWithCovarianceStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__PoseWithCovarianceStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__PoseWithCovarianceStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__PoseWithCovarianceStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__PoseWithCovarianceStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__PoseWithCovarianceStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__QuaternionStamped {
    pub header: std_msgs__msg__Header,
    pub quaternion: geometry_msgs__msg__Quaternion,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__QuaternionStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__QuaternionStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__QuaternionStamped>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__QuaternionStamped)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__QuaternionStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__QuaternionStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__QuaternionStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quaternion) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__QuaternionStamped),
            "::",
            stringify!(quaternion)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__QuaternionStamped__Sequence {
    pub data: *mut geometry_msgs__msg__QuaternionStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__QuaternionStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__QuaternionStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__QuaternionStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__QuaternionStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__QuaternionStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__QuaternionStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__QuaternionStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__QuaternionStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__QuaternionStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Transform {
    pub translation: geometry_msgs__msg__Vector3,
    pub rotation: geometry_msgs__msg__Quaternion,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Transform() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Transform> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Transform>(),
        56usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Transform))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Transform>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Transform))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).translation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Transform),
            "::",
            stringify!(translation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Transform),
            "::",
            stringify!(rotation)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Transform__Sequence {
    pub data: *mut geometry_msgs__msg__Transform,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Transform__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Transform__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Transform__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Transform__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Transform__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Transform__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Transform__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Transform__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Transform__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__TransformStamped {
    pub header: std_msgs__msg__Header,
    pub child_frame_id: rosidl_runtime_c__String,
    pub transform: geometry_msgs__msg__Transform,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__TransformStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__TransformStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__TransformStamped>(),
        112usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__TransformStamped)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__TransformStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__TransformStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TransformStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).child_frame_id) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TransformStamped),
            "::",
            stringify!(child_frame_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transform) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TransformStamped),
            "::",
            stringify!(transform)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__TransformStamped__Sequence {
    pub data: *mut geometry_msgs__msg__TransformStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__TransformStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__TransformStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__TransformStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__TransformStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__TransformStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__TransformStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TransformStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TransformStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TransformStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Twist {
    pub linear: geometry_msgs__msg__Vector3,
    pub angular: geometry_msgs__msg__Vector3,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Twist() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Twist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Twist>(),
        48usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Twist))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Twist>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Twist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Twist),
            "::",
            stringify!(linear)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angular) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Twist),
            "::",
            stringify!(angular)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Twist__Sequence {
    pub data: *mut geometry_msgs__msg__Twist,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Twist__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Twist__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Twist__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Twist__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Twist__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Twist__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Twist__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Twist__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Twist__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__TwistStamped {
    pub header: std_msgs__msg__Header,
    pub twist: geometry_msgs__msg__Twist,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__TwistStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__TwistStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__TwistStamped>(),
        80usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__TwistStamped))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__TwistStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__TwistStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).twist) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistStamped),
            "::",
            stringify!(twist)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__TwistStamped__Sequence {
    pub data: *mut geometry_msgs__msg__TwistStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__TwistStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__TwistStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__TwistStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__TwistStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__TwistStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__TwistStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__TwistWithCovariance {
    pub twist: geometry_msgs__msg__Twist,
    pub covariance: [f64; 36usize],
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__TwistWithCovariance() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__TwistWithCovariance> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__TwistWithCovariance>(),
        336usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__TwistWithCovariance)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__TwistWithCovariance>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__TwistWithCovariance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).twist) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovariance),
            "::",
            stringify!(twist)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).covariance) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovariance),
            "::",
            stringify!(covariance)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__TwistWithCovariance__Sequence {
    pub data: *mut geometry_msgs__msg__TwistWithCovariance,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__TwistWithCovariance__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__TwistWithCovariance__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__TwistWithCovariance__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__TwistWithCovariance__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__TwistWithCovariance__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__TwistWithCovariance__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovariance__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovariance__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovariance__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__TwistWithCovarianceStamped {
    pub header: std_msgs__msg__Header,
    pub twist: geometry_msgs__msg__TwistWithCovariance,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__TwistWithCovarianceStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__TwistWithCovarianceStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__TwistWithCovarianceStamped>(),
        368usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__TwistWithCovarianceStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).twist) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped),
            "::",
            stringify!(twist)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__TwistWithCovarianceStamped__Sequence {
    pub data: *mut geometry_msgs__msg__TwistWithCovarianceStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__TwistWithCovarianceStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<
        geometry_msgs__msg__TwistWithCovarianceStamped__Sequence,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__TwistWithCovarianceStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__TwistWithCovarianceStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__TwistWithCovarianceStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__Vector3Stamped {
    pub header: std_msgs__msg__Header,
    pub vector: geometry_msgs__msg__Vector3,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Vector3Stamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Vector3Stamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Vector3Stamped>(),
        56usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Vector3Stamped))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Vector3Stamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Vector3Stamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3Stamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3Stamped),
            "::",
            stringify!(vector)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Vector3Stamped__Sequence {
    pub data: *mut geometry_msgs__msg__Vector3Stamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Vector3Stamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Vector3Stamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Vector3Stamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Vector3Stamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Vector3Stamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Vector3Stamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3Stamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3Stamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Vector3Stamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Wrench {
    pub force: geometry_msgs__msg__Vector3,
    pub torque: geometry_msgs__msg__Vector3,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Wrench() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Wrench> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Wrench>(),
        48usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__Wrench))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Wrench>(),
        8usize,
        concat!("Alignment of ", stringify!(geometry_msgs__msg__Wrench))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).force) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Wrench),
            "::",
            stringify!(force)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).torque) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Wrench),
            "::",
            stringify!(torque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__Wrench__Sequence {
    pub data: *mut geometry_msgs__msg__Wrench,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__Wrench__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__Wrench__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__Wrench__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__Wrench__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__Wrench__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__Wrench__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Wrench__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Wrench__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__Wrench__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct geometry_msgs__msg__WrenchStamped {
    pub header: std_msgs__msg__Header,
    pub wrench: geometry_msgs__msg__Wrench,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__WrenchStamped() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__WrenchStamped> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__WrenchStamped>(),
        80usize,
        concat!("Size of: ", stringify!(geometry_msgs__msg__WrenchStamped))
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__WrenchStamped>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__WrenchStamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__WrenchStamped),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrench) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__WrenchStamped),
            "::",
            stringify!(wrench)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct geometry_msgs__msg__WrenchStamped__Sequence {
    pub data: *mut geometry_msgs__msg__WrenchStamped,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_geometry_msgs__msg__WrenchStamped__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<geometry_msgs__msg__WrenchStamped__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<geometry_msgs__msg__WrenchStamped__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(geometry_msgs__msg__WrenchStamped__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<geometry_msgs__msg__WrenchStamped__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(geometry_msgs__msg__WrenchStamped__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__WrenchStamped__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__WrenchStamped__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(geometry_msgs__msg__WrenchStamped__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub const lifecycle_msgs__msg__State__PRIMARY_STATE_UNKNOWN: _bindgen_ty_16 =
    _bindgen_ty_16::lifecycle_msgs__msg__State__PRIMARY_STATE_UNKNOWN;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_16 {
    lifecycle_msgs__msg__State__PRIMARY_STATE_UNKNOWN = 0,
}
pub const lifecycle_msgs__msg__State__PRIMARY_STATE_UNCONFIGURED: _bindgen_ty_17 =
    _bindgen_ty_17::lifecycle_msgs__msg__State__PRIMARY_STATE_UNCONFIGURED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_17 {
    lifecycle_msgs__msg__State__PRIMARY_STATE_UNCONFIGURED = 1,
}
pub const lifecycle_msgs__msg__State__PRIMARY_STATE_INACTIVE: _bindgen_ty_18 =
    _bindgen_ty_18::lifecycle_msgs__msg__State__PRIMARY_STATE_INACTIVE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_18 {
    lifecycle_msgs__msg__State__PRIMARY_STATE_INACTIVE = 2,
}
pub const lifecycle_msgs__msg__State__PRIMARY_STATE_ACTIVE: _bindgen_ty_19 =
    _bindgen_ty_19::lifecycle_msgs__msg__State__PRIMARY_STATE_ACTIVE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_19 {
    lifecycle_msgs__msg__State__PRIMARY_STATE_ACTIVE = 3,
}
pub const lifecycle_msgs__msg__State__PRIMARY_STATE_FINALIZED: _bindgen_ty_20 =
    _bindgen_ty_20::lifecycle_msgs__msg__State__PRIMARY_STATE_FINALIZED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_20 {
    lifecycle_msgs__msg__State__PRIMARY_STATE_FINALIZED = 4,
}
pub const lifecycle_msgs__msg__State__TRANSITION_STATE_CONFIGURING: _bindgen_ty_21 =
    _bindgen_ty_21::lifecycle_msgs__msg__State__TRANSITION_STATE_CONFIGURING;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_21 {
    lifecycle_msgs__msg__State__TRANSITION_STATE_CONFIGURING = 10,
}
pub const lifecycle_msgs__msg__State__TRANSITION_STATE_CLEANINGUP: _bindgen_ty_22 =
    _bindgen_ty_22::lifecycle_msgs__msg__State__TRANSITION_STATE_CLEANINGUP;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_22 {
    lifecycle_msgs__msg__State__TRANSITION_STATE_CLEANINGUP = 11,
}
pub const lifecycle_msgs__msg__State__TRANSITION_STATE_SHUTTINGDOWN: _bindgen_ty_23 =
    _bindgen_ty_23::lifecycle_msgs__msg__State__TRANSITION_STATE_SHUTTINGDOWN;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_23 {
    lifecycle_msgs__msg__State__TRANSITION_STATE_SHUTTINGDOWN = 12,
}
pub const lifecycle_msgs__msg__State__TRANSITION_STATE_ACTIVATING: _bindgen_ty_24 =
    _bindgen_ty_24::lifecycle_msgs__msg__State__TRANSITION_STATE_ACTIVATING;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_24 {
    lifecycle_msgs__msg__State__TRANSITION_STATE_ACTIVATING = 13,
}
pub const lifecycle_msgs__msg__State__TRANSITION_STATE_DEACTIVATING: _bindgen_ty_25 =
    _bindgen_ty_25::lifecycle_msgs__msg__State__TRANSITION_STATE_DEACTIVATING;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_25 {
    lifecycle_msgs__msg__State__TRANSITION_STATE_DEACTIVATING = 14,
}
pub const lifecycle_msgs__msg__State__TRANSITION_STATE_ERRORPROCESSING: _bindgen_ty_26 =
    _bindgen_ty_26::lifecycle_msgs__msg__State__TRANSITION_STATE_ERRORPROCESSING;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_26 {
    lifecycle_msgs__msg__State__TRANSITION_STATE_ERRORPROCESSING = 15,
}
#[repr(C)]
pub struct lifecycle_msgs__msg__State {
    pub id: u8,
    pub label: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__msg__State() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__msg__State> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__msg__State>(),
        32usize,
        concat!("Size of: ", stringify!(lifecycle_msgs__msg__State))
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__msg__State>(),
        8usize,
        concat!("Alignment of ", stringify!(lifecycle_msgs__msg__State))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__State),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__State),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__msg__State__Sequence {
    pub data: *mut lifecycle_msgs__msg__State,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__msg__State__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__msg__State__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__msg__State__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__msg__State__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__msg__State__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__msg__State__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__State__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__State__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__State__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_CREATE: _bindgen_ty_27 =
    _bindgen_ty_27::lifecycle_msgs__msg__Transition__TRANSITION_CREATE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_27 {
    lifecycle_msgs__msg__Transition__TRANSITION_CREATE = 0,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_CONFIGURE: _bindgen_ty_28 =
    _bindgen_ty_28::lifecycle_msgs__msg__Transition__TRANSITION_CONFIGURE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_28 {
    lifecycle_msgs__msg__Transition__TRANSITION_CONFIGURE = 1,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_CLEANUP: _bindgen_ty_29 =
    _bindgen_ty_29::lifecycle_msgs__msg__Transition__TRANSITION_CLEANUP;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_29 {
    lifecycle_msgs__msg__Transition__TRANSITION_CLEANUP = 2,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ACTIVATE: _bindgen_ty_30 =
    _bindgen_ty_30::lifecycle_msgs__msg__Transition__TRANSITION_ACTIVATE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_30 {
    lifecycle_msgs__msg__Transition__TRANSITION_ACTIVATE = 3,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_DEACTIVATE: _bindgen_ty_31 =
    _bindgen_ty_31::lifecycle_msgs__msg__Transition__TRANSITION_DEACTIVATE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_31 {
    lifecycle_msgs__msg__Transition__TRANSITION_DEACTIVATE = 4,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_UNCONFIGURED_SHUTDOWN: _bindgen_ty_32 =
    _bindgen_ty_32::lifecycle_msgs__msg__Transition__TRANSITION_UNCONFIGURED_SHUTDOWN;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_32 {
    lifecycle_msgs__msg__Transition__TRANSITION_UNCONFIGURED_SHUTDOWN = 5,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_INACTIVE_SHUTDOWN: _bindgen_ty_33 =
    _bindgen_ty_33::lifecycle_msgs__msg__Transition__TRANSITION_INACTIVE_SHUTDOWN;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_33 {
    lifecycle_msgs__msg__Transition__TRANSITION_INACTIVE_SHUTDOWN = 6,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ACTIVE_SHUTDOWN: _bindgen_ty_34 =
    _bindgen_ty_34::lifecycle_msgs__msg__Transition__TRANSITION_ACTIVE_SHUTDOWN;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_34 {
    lifecycle_msgs__msg__Transition__TRANSITION_ACTIVE_SHUTDOWN = 7,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_DESTROY: _bindgen_ty_35 =
    _bindgen_ty_35::lifecycle_msgs__msg__Transition__TRANSITION_DESTROY;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_35 {
    lifecycle_msgs__msg__Transition__TRANSITION_DESTROY = 8,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_SUCCESS: _bindgen_ty_36 =
    _bindgen_ty_36::lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_SUCCESS;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_36 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_SUCCESS = 10,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_FAILURE: _bindgen_ty_37 =
    _bindgen_ty_37::lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_FAILURE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_37 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_FAILURE = 11,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_ERROR: _bindgen_ty_38 =
    _bindgen_ty_38::lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_ERROR;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_38 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_CONFIGURE_ERROR = 12,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_SUCCESS: _bindgen_ty_39 =
    _bindgen_ty_39::lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_SUCCESS;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_39 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_SUCCESS = 20,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_FAILURE: _bindgen_ty_40 =
    _bindgen_ty_40::lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_FAILURE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_40 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_FAILURE = 21,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_ERROR: _bindgen_ty_41 =
    _bindgen_ty_41::lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_ERROR;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_41 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_CLEANUP_ERROR = 22,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_SUCCESS: _bindgen_ty_42 =
    _bindgen_ty_42::lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_SUCCESS;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_42 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_SUCCESS = 30,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_FAILURE: _bindgen_ty_43 =
    _bindgen_ty_43::lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_FAILURE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_43 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_FAILURE = 31,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_ERROR: _bindgen_ty_44 =
    _bindgen_ty_44::lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_ERROR;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_44 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_ACTIVATE_ERROR = 32,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_SUCCESS: _bindgen_ty_45 =
    _bindgen_ty_45::lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_SUCCESS;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_45 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_SUCCESS = 40,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_FAILURE: _bindgen_ty_46 =
    _bindgen_ty_46::lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_FAILURE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_46 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_FAILURE = 41,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_ERROR: _bindgen_ty_47 =
    _bindgen_ty_47::lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_ERROR;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_47 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_DEACTIVATE_ERROR = 42,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_SUCCESS: _bindgen_ty_48 =
    _bindgen_ty_48::lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_SUCCESS;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_48 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_SUCCESS = 50,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_FAILURE: _bindgen_ty_49 =
    _bindgen_ty_49::lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_FAILURE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_49 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_FAILURE = 51,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_ERROR: _bindgen_ty_50 =
    _bindgen_ty_50::lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_ERROR;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_50 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_SHUTDOWN_ERROR = 52,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_SUCCESS: _bindgen_ty_51 =
    _bindgen_ty_51::lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_SUCCESS;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_51 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_SUCCESS = 60,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_FAILURE: _bindgen_ty_52 =
    _bindgen_ty_52::lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_FAILURE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_52 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_FAILURE = 61,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_ERROR: _bindgen_ty_53 =
    _bindgen_ty_53::lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_ERROR;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_53 {
    lifecycle_msgs__msg__Transition__TRANSITION_ON_ERROR_ERROR = 62,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_SUCCESS: _bindgen_ty_54 =
    _bindgen_ty_54::lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_SUCCESS;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_54 {
    lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_SUCCESS = 97,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_FAILURE: _bindgen_ty_55 =
    _bindgen_ty_55::lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_FAILURE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_55 {
    lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_FAILURE = 98,
}
pub const lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_ERROR: _bindgen_ty_56 =
    _bindgen_ty_56::lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_ERROR;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_56 {
    lifecycle_msgs__msg__Transition__TRANSITION_CALLBACK_ERROR = 99,
}
#[repr(C)]
pub struct lifecycle_msgs__msg__Transition {
    pub id: u8,
    pub label: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__msg__Transition() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__msg__Transition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__msg__Transition>(),
        32usize,
        concat!("Size of: ", stringify!(lifecycle_msgs__msg__Transition))
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__msg__Transition>(),
        8usize,
        concat!("Alignment of ", stringify!(lifecycle_msgs__msg__Transition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__Transition),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__Transition),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__msg__Transition__Sequence {
    pub data: *mut lifecycle_msgs__msg__Transition,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__msg__Transition__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__msg__Transition__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__msg__Transition__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__msg__Transition__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__msg__Transition__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__msg__Transition__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__Transition__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__Transition__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__Transition__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct lifecycle_msgs__msg__TransitionDescription {
    pub transition: lifecycle_msgs__msg__Transition,
    pub start_state: lifecycle_msgs__msg__State,
    pub goal_state: lifecycle_msgs__msg__State,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__msg__TransitionDescription() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__msg__TransitionDescription> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__msg__TransitionDescription>(),
        96usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__msg__TransitionDescription)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__msg__TransitionDescription>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__msg__TransitionDescription)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transition) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionDescription),
            "::",
            stringify!(transition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_state) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionDescription),
            "::",
            stringify!(start_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).goal_state) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionDescription),
            "::",
            stringify!(goal_state)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__msg__TransitionDescription__Sequence {
    pub data: *mut lifecycle_msgs__msg__TransitionDescription,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__msg__TransitionDescription__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__msg__TransitionDescription__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__msg__TransitionDescription__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__msg__TransitionDescription__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__msg__TransitionDescription__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__msg__TransitionDescription__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionDescription__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionDescription__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionDescription__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct lifecycle_msgs__msg__TransitionEvent {
    pub timestamp: u64,
    pub transition: lifecycle_msgs__msg__Transition,
    pub start_state: lifecycle_msgs__msg__State,
    pub goal_state: lifecycle_msgs__msg__State,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__msg__TransitionEvent() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__msg__TransitionEvent> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__msg__TransitionEvent>(),
        104usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__msg__TransitionEvent>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__msg__TransitionEvent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transition) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent),
            "::",
            stringify!(transition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_state) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent),
            "::",
            stringify!(start_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).goal_state) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent),
            "::",
            stringify!(goal_state)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__msg__TransitionEvent__Sequence {
    pub data: *mut lifecycle_msgs__msg__TransitionEvent,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__msg__TransitionEvent__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__msg__TransitionEvent__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__msg__TransitionEvent__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__msg__TransitionEvent__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__msg__TransitionEvent__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__msg__TransitionEvent__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct lifecycle_msgs__srv__ChangeState_Request {
    pub transition: lifecycle_msgs__msg__Transition,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__ChangeState_Request() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__ChangeState_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__ChangeState_Request>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__ChangeState_Request>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__ChangeState_Request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transition) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Request),
            "::",
            stringify!(transition)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__ChangeState_Request__Sequence {
    pub data: *mut lifecycle_msgs__srv__ChangeState_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__ChangeState_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__ChangeState_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__ChangeState_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__ChangeState_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__ChangeState_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__ChangeState_Response {
    pub success: bool,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__ChangeState_Response() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__ChangeState_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__ChangeState_Response>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__ChangeState_Response>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__ChangeState_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).success) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Response),
            "::",
            stringify!(success)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__ChangeState_Response__Sequence {
    pub data: *mut lifecycle_msgs__srv__ChangeState_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__ChangeState_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__ChangeState_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__ChangeState_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__ChangeState_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__ChangeState_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__ChangeState_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetAvailableStates_Request {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetAvailableStates_Request() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__GetAvailableStates_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetAvailableStates_Request>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetAvailableStates_Request>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Request)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Request),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetAvailableStates_Request__Sequence {
    pub data: *mut lifecycle_msgs__srv__GetAvailableStates_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetAvailableStates_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<
        lifecycle_msgs__srv__GetAvailableStates_Request__Sequence,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetAvailableStates_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetAvailableStates_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetAvailableStates_Response {
    pub available_states: lifecycle_msgs__msg__State__Sequence,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetAvailableStates_Response() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__GetAvailableStates_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetAvailableStates_Response>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetAvailableStates_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).available_states) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Response),
            "::",
            stringify!(available_states)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetAvailableStates_Response__Sequence {
    pub data: *mut lifecycle_msgs__srv__GetAvailableStates_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetAvailableStates_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<
        lifecycle_msgs__srv__GetAvailableStates_Response__Sequence,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetAvailableStates_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetAvailableStates_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableStates_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetAvailableTransitions_Request {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetAvailableTransitions_Request() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__GetAvailableTransitions_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetAvailableTransitions_Request>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetAvailableTransitions_Request>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Request)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Request),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence {
    pub data: *mut lifecycle_msgs__srv__GetAvailableTransitions_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<
        lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetAvailableTransitions_Response {
    pub available_transitions: lifecycle_msgs__msg__TransitionDescription__Sequence,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetAvailableTransitions_Response() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__GetAvailableTransitions_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetAvailableTransitions_Response>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetAvailableTransitions_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).available_transitions) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Response),
            "::",
            stringify!(available_transitions)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence {
    pub data: *mut lifecycle_msgs__srv__GetAvailableTransitions_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<
        lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetAvailableTransitions_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetState_Request {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetState_Request() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__GetState_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetState_Request>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetState_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetState_Request>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetState_Request)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetState_Request),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetState_Request__Sequence {
    pub data: *mut lifecycle_msgs__srv__GetState_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetState_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__GetState_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetState_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetState_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetState_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetState_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetState_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetState_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetState_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct lifecycle_msgs__srv__GetState_Response {
    pub current_state: lifecycle_msgs__msg__State,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetState_Response() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__GetState_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetState_Response>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetState_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetState_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetState_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetState_Response),
            "::",
            stringify!(current_state)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lifecycle_msgs__srv__GetState_Response__Sequence {
    pub data: *mut lifecycle_msgs__srv__GetState_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_lifecycle_msgs__srv__GetState_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<lifecycle_msgs__srv__GetState_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lifecycle_msgs__srv__GetState_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lifecycle_msgs__srv__GetState_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lifecycle_msgs__srv__GetState_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lifecycle_msgs__srv__GetState_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetState_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetState_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lifecycle_msgs__srv__GetState_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct map_msgs__msg__OccupancyGridUpdate {
    pub header: std_msgs__msg__Header,
    pub x: i32,
    pub y: i32,
    pub width: u32,
    pub height: u32,
    pub data: rosidl_runtime_c__int8__Sequence,
}
#[test]
fn bindgen_test_layout_map_msgs__msg__OccupancyGridUpdate() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__msg__OccupancyGridUpdate> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__msg__OccupancyGridUpdate>(),
        72usize,
        concat!("Size of: ", stringify!(map_msgs__msg__OccupancyGridUpdate))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__msg__OccupancyGridUpdate>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__msg__OccupancyGridUpdate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__msg__OccupancyGridUpdate__Sequence {
    pub data: *mut map_msgs__msg__OccupancyGridUpdate,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__msg__OccupancyGridUpdate__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__msg__OccupancyGridUpdate__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__msg__OccupancyGridUpdate__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__msg__OccupancyGridUpdate__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__msg__OccupancyGridUpdate__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__OccupancyGridUpdate__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub const map_msgs__msg__PointCloud2Update__ADD: _bindgen_ty_57 =
    _bindgen_ty_57::map_msgs__msg__PointCloud2Update__ADD;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_57 {
    map_msgs__msg__PointCloud2Update__ADD = 0,
}
pub const map_msgs__msg__PointCloud2Update__DELETE: _bindgen_ty_58 =
    _bindgen_ty_58::map_msgs__msg__PointCloud2Update__DELETE;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_58 {
    map_msgs__msg__PointCloud2Update__DELETE = 1,
}
pub const sensor_msgs__msg__PointField__INT8: _bindgen_ty_59 =
    _bindgen_ty_59::sensor_msgs__msg__PointField__INT8;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_59 {
    sensor_msgs__msg__PointField__INT8 = 1,
}
pub const sensor_msgs__msg__PointField__UINT8: _bindgen_ty_60 =
    _bindgen_ty_60::sensor_msgs__msg__PointField__UINT8;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_60 {
    sensor_msgs__msg__PointField__UINT8 = 2,
}
pub const sensor_msgs__msg__PointField__INT16: _bindgen_ty_61 =
    _bindgen_ty_61::sensor_msgs__msg__PointField__INT16;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_61 {
    sensor_msgs__msg__PointField__INT16 = 3,
}
pub const sensor_msgs__msg__PointField__UINT16: _bindgen_ty_62 =
    _bindgen_ty_62::sensor_msgs__msg__PointField__UINT16;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_62 {
    sensor_msgs__msg__PointField__UINT16 = 4,
}
pub const sensor_msgs__msg__PointField__INT32: _bindgen_ty_63 =
    _bindgen_ty_63::sensor_msgs__msg__PointField__INT32;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_63 {
    sensor_msgs__msg__PointField__INT32 = 5,
}
pub const sensor_msgs__msg__PointField__UINT32: _bindgen_ty_64 =
    _bindgen_ty_64::sensor_msgs__msg__PointField__UINT32;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_64 {
    sensor_msgs__msg__PointField__UINT32 = 6,
}
pub const sensor_msgs__msg__PointField__FLOAT32: _bindgen_ty_65 =
    _bindgen_ty_65::sensor_msgs__msg__PointField__FLOAT32;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_65 {
    sensor_msgs__msg__PointField__FLOAT32 = 7,
}
pub const sensor_msgs__msg__PointField__FLOAT64: _bindgen_ty_66 =
    _bindgen_ty_66::sensor_msgs__msg__PointField__FLOAT64;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_66 {
    sensor_msgs__msg__PointField__FLOAT64 = 8,
}
#[repr(C)]
pub struct sensor_msgs__msg__PointField {
    pub name: rosidl_runtime_c__String,
    pub offset: u32,
    pub datatype: u8,
    pub count: u32,
}
#[test]
fn bindgen_test_layout_sensor_msgs__msg__PointField() {
    const UNINIT: ::std::mem::MaybeUninit<sensor_msgs__msg__PointField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sensor_msgs__msg__PointField>(),
        40usize,
        concat!("Size of: ", stringify!(sensor_msgs__msg__PointField))
    );
    assert_eq!(
        ::std::mem::align_of::<sensor_msgs__msg__PointField>(),
        8usize,
        concat!("Alignment of ", stringify!(sensor_msgs__msg__PointField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointField),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointField),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datatype) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointField),
            "::",
            stringify!(datatype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointField),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct sensor_msgs__msg__PointField__Sequence {
    pub data: *mut sensor_msgs__msg__PointField,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_sensor_msgs__msg__PointField__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<sensor_msgs__msg__PointField__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sensor_msgs__msg__PointField__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(sensor_msgs__msg__PointField__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<sensor_msgs__msg__PointField__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(sensor_msgs__msg__PointField__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointField__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointField__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointField__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct sensor_msgs__msg__PointCloud2 {
    pub header: std_msgs__msg__Header,
    pub height: u32,
    pub width: u32,
    pub fields: sensor_msgs__msg__PointField__Sequence,
    pub is_bigendian: bool,
    pub point_step: u32,
    pub row_step: u32,
    pub data: rosidl_runtime_c__uint8__Sequence,
    pub is_dense: bool,
}
#[test]
fn bindgen_test_layout_sensor_msgs__msg__PointCloud2() {
    const UNINIT: ::std::mem::MaybeUninit<sensor_msgs__msg__PointCloud2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sensor_msgs__msg__PointCloud2>(),
        112usize,
        concat!("Size of: ", stringify!(sensor_msgs__msg__PointCloud2))
    );
    assert_eq!(
        ::std::mem::align_of::<sensor_msgs__msg__PointCloud2>(),
        8usize,
        concat!("Alignment of ", stringify!(sensor_msgs__msg__PointCloud2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fields) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_bigendian) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(is_bigendian)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).point_step) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(point_step)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).row_step) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(row_step)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_dense) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2),
            "::",
            stringify!(is_dense)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct sensor_msgs__msg__PointCloud2__Sequence {
    pub data: *mut sensor_msgs__msg__PointCloud2,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_sensor_msgs__msg__PointCloud2__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<sensor_msgs__msg__PointCloud2__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sensor_msgs__msg__PointCloud2__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(sensor_msgs__msg__PointCloud2__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<sensor_msgs__msg__PointCloud2__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(sensor_msgs__msg__PointCloud2__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sensor_msgs__msg__PointCloud2__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct map_msgs__msg__PointCloud2Update {
    pub header: std_msgs__msg__Header,
    pub type_: u32,
    pub points: sensor_msgs__msg__PointCloud2,
}
#[test]
fn bindgen_test_layout_map_msgs__msg__PointCloud2Update() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__msg__PointCloud2Update> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__msg__PointCloud2Update>(),
        152usize,
        concat!("Size of: ", stringify!(map_msgs__msg__PointCloud2Update))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__msg__PointCloud2Update>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__msg__PointCloud2Update)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__PointCloud2Update),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__PointCloud2Update),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).points) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__PointCloud2Update),
            "::",
            stringify!(points)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__msg__PointCloud2Update__Sequence {
    pub data: *mut map_msgs__msg__PointCloud2Update,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__msg__PointCloud2Update__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__msg__PointCloud2Update__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__msg__PointCloud2Update__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__msg__PointCloud2Update__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__msg__PointCloud2Update__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__msg__PointCloud2Update__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__PointCloud2Update__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__PointCloud2Update__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__PointCloud2Update__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__msg__MapMetaData {
    pub map_load_time: builtin_interfaces__msg__Time,
    pub resolution: f32,
    pub width: u32,
    pub height: u32,
    pub origin: geometry_msgs__msg__Pose,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__MapMetaData() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__MapMetaData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__MapMetaData>(),
        80usize,
        concat!("Size of: ", stringify!(nav_msgs__msg__MapMetaData))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__MapMetaData>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__msg__MapMetaData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map_load_time) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__MapMetaData),
            "::",
            stringify!(map_load_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolution) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__MapMetaData),
            "::",
            stringify!(resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__MapMetaData),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__MapMetaData),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).origin) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__MapMetaData),
            "::",
            stringify!(origin)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__msg__MapMetaData__Sequence {
    pub data: *mut nav_msgs__msg__MapMetaData,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__MapMetaData__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__MapMetaData__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__MapMetaData__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(nav_msgs__msg__MapMetaData__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__MapMetaData__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__msg__MapMetaData__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__MapMetaData__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__MapMetaData__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__MapMetaData__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct nav_msgs__msg__OccupancyGrid {
    pub header: std_msgs__msg__Header,
    pub info: nav_msgs__msg__MapMetaData,
    pub data: rosidl_runtime_c__int8__Sequence,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__OccupancyGrid() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__OccupancyGrid> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__OccupancyGrid>(),
        136usize,
        concat!("Size of: ", stringify!(nav_msgs__msg__OccupancyGrid))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__OccupancyGrid>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__msg__OccupancyGrid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__OccupancyGrid),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__OccupancyGrid),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__OccupancyGrid),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__msg__OccupancyGrid__Sequence {
    pub data: *mut nav_msgs__msg__OccupancyGrid,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__OccupancyGrid__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__OccupancyGrid__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__OccupancyGrid__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(nav_msgs__msg__OccupancyGrid__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__OccupancyGrid__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__msg__OccupancyGrid__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__OccupancyGrid__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__OccupancyGrid__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__OccupancyGrid__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct map_msgs__msg__ProjectedMap {
    pub map: nav_msgs__msg__OccupancyGrid,
    pub min_z: f64,
    pub max_z: f64,
}
#[test]
fn bindgen_test_layout_map_msgs__msg__ProjectedMap() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__msg__ProjectedMap> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__msg__ProjectedMap>(),
        152usize,
        concat!("Size of: ", stringify!(map_msgs__msg__ProjectedMap))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__msg__ProjectedMap>(),
        8usize,
        concat!("Alignment of ", stringify!(map_msgs__msg__ProjectedMap))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMap),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_z) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMap),
            "::",
            stringify!(min_z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_z) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMap),
            "::",
            stringify!(max_z)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__msg__ProjectedMap__Sequence {
    pub data: *mut map_msgs__msg__ProjectedMap,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__msg__ProjectedMap__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__msg__ProjectedMap__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__msg__ProjectedMap__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__msg__ProjectedMap__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__msg__ProjectedMap__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__msg__ProjectedMap__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMap__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMap__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMap__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct map_msgs__msg__ProjectedMapInfo {
    pub frame_id: rosidl_runtime_c__String,
    pub x: f64,
    pub y: f64,
    pub width: f64,
    pub height: f64,
    pub min_z: f64,
    pub max_z: f64,
}
#[test]
fn bindgen_test_layout_map_msgs__msg__ProjectedMapInfo() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__msg__ProjectedMapInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__msg__ProjectedMapInfo>(),
        72usize,
        concat!("Size of: ", stringify!(map_msgs__msg__ProjectedMapInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__msg__ProjectedMapInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(map_msgs__msg__ProjectedMapInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo),
            "::",
            stringify!(frame_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_z) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo),
            "::",
            stringify!(min_z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_z) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo),
            "::",
            stringify!(max_z)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__msg__ProjectedMapInfo__Sequence {
    pub data: *mut map_msgs__msg__ProjectedMapInfo,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__msg__ProjectedMapInfo__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__msg__ProjectedMapInfo__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__msg__ProjectedMapInfo__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__msg__ProjectedMapInfo__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__msg__ProjectedMapInfo__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__msg__ProjectedMapInfo__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__msg__ProjectedMapInfo__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetMapROI_Request {
    pub x: f64,
    pub y: f64,
    pub l_x: f64,
    pub l_y: f64,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetMapROI_Request() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetMapROI_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetMapROI_Request>(),
        32usize,
        concat!("Size of: ", stringify!(map_msgs__srv__GetMapROI_Request))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetMapROI_Request>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetMapROI_Request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Request),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Request),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_x) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Request),
            "::",
            stringify!(l_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_y) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Request),
            "::",
            stringify!(l_y)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetMapROI_Request__Sequence {
    pub data: *mut map_msgs__srv__GetMapROI_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetMapROI_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetMapROI_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetMapROI_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__GetMapROI_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetMapROI_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetMapROI_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct map_msgs__srv__GetMapROI_Response {
    pub sub_map: nav_msgs__msg__OccupancyGrid,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetMapROI_Response() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetMapROI_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetMapROI_Response>(),
        136usize,
        concat!("Size of: ", stringify!(map_msgs__srv__GetMapROI_Response))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetMapROI_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetMapROI_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sub_map) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Response),
            "::",
            stringify!(sub_map)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetMapROI_Response__Sequence {
    pub data: *mut map_msgs__srv__GetMapROI_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetMapROI_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetMapROI_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetMapROI_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__GetMapROI_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetMapROI_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetMapROI_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetMapROI_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetPointMap_Request {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetPointMap_Request() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetPointMap_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetPointMap_Request>(),
        1usize,
        concat!("Size of: ", stringify!(map_msgs__srv__GetPointMap_Request))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetPointMap_Request>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetPointMap_Request)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMap_Request),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetPointMap_Request__Sequence {
    pub data: *mut map_msgs__srv__GetPointMap_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetPointMap_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetPointMap_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetPointMap_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__GetPointMap_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetPointMap_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetPointMap_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMap_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMap_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMap_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct map_msgs__srv__GetPointMap_Response {
    pub map: sensor_msgs__msg__PointCloud2,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetPointMap_Response() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetPointMap_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetPointMap_Response>(),
        112usize,
        concat!("Size of: ", stringify!(map_msgs__srv__GetPointMap_Response))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetPointMap_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetPointMap_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMap_Response),
            "::",
            stringify!(map)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetPointMap_Response__Sequence {
    pub data: *mut map_msgs__srv__GetPointMap_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetPointMap_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetPointMap_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetPointMap_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__GetPointMap_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetPointMap_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetPointMap_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMap_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMap_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMap_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetPointMapROI_Request {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub r: f64,
    pub l_x: f64,
    pub l_y: f64,
    pub l_z: f64,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetPointMapROI_Request() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetPointMapROI_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetPointMapROI_Request>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetPointMapROI_Request>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetPointMapROI_Request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_x) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request),
            "::",
            stringify!(l_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_y) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request),
            "::",
            stringify!(l_y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_z) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request),
            "::",
            stringify!(l_z)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetPointMapROI_Request__Sequence {
    pub data: *mut map_msgs__srv__GetPointMapROI_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetPointMapROI_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetPointMapROI_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetPointMapROI_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetPointMapROI_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetPointMapROI_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct map_msgs__srv__GetPointMapROI_Response {
    pub sub_map: sensor_msgs__msg__PointCloud2,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetPointMapROI_Response() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetPointMapROI_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetPointMapROI_Response>(),
        112usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__GetPointMapROI_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetPointMapROI_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetPointMapROI_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sub_map) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Response),
            "::",
            stringify!(sub_map)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__GetPointMapROI_Response__Sequence {
    pub data: *mut map_msgs__srv__GetPointMapROI_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__GetPointMapROI_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__GetPointMapROI_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__GetPointMapROI_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__GetPointMapROI_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__GetPointMapROI_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__GetPointMapROI_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__GetPointMapROI_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__ProjectedMapsInfo_Request {
    pub projected_maps_info: map_msgs__msg__ProjectedMapInfo__Sequence,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__ProjectedMapsInfo_Request() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__ProjectedMapsInfo_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__ProjectedMapsInfo_Request>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__ProjectedMapsInfo_Request>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).projected_maps_info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Request),
            "::",
            stringify!(projected_maps_info)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__ProjectedMapsInfo_Request__Sequence {
    pub data: *mut map_msgs__srv__ProjectedMapsInfo_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__ProjectedMapsInfo_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__ProjectedMapsInfo_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__ProjectedMapsInfo_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__ProjectedMapsInfo_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__ProjectedMapsInfo_Response {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__ProjectedMapsInfo_Response() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__ProjectedMapsInfo_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__ProjectedMapsInfo_Response>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__ProjectedMapsInfo_Response>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Response)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Response),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__ProjectedMapsInfo_Response__Sequence {
    pub data: *mut map_msgs__srv__ProjectedMapsInfo_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__ProjectedMapsInfo_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__ProjectedMapsInfo_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__ProjectedMapsInfo_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__ProjectedMapsInfo_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__ProjectedMapsInfo_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct std_msgs__msg__String {
    pub data: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__String() {
    const UNINIT: ::std::mem::MaybeUninit<std_msgs__msg__String> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__String>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__String))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__String>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__String))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__String),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_msgs__msg__String__Sequence {
    pub data: *mut std_msgs__msg__String,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__String__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<std_msgs__msg__String__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__String__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__String__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__String__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__String__Sequence))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__String__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__String__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__String__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct map_msgs__srv__SaveMap_Request {
    pub filename: std_msgs__msg__String,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__SaveMap_Request() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__SaveMap_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__SaveMap_Request>(),
        24usize,
        concat!("Size of: ", stringify!(map_msgs__srv__SaveMap_Request))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__SaveMap_Request>(),
        8usize,
        concat!("Alignment of ", stringify!(map_msgs__srv__SaveMap_Request))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SaveMap_Request),
            "::",
            stringify!(filename)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__SaveMap_Request__Sequence {
    pub data: *mut map_msgs__srv__SaveMap_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__SaveMap_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__SaveMap_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__SaveMap_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__SaveMap_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__SaveMap_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__SaveMap_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SaveMap_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SaveMap_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SaveMap_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__SaveMap_Response {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__SaveMap_Response() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__SaveMap_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__SaveMap_Response>(),
        1usize,
        concat!("Size of: ", stringify!(map_msgs__srv__SaveMap_Response))
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__SaveMap_Response>(),
        1usize,
        concat!("Alignment of ", stringify!(map_msgs__srv__SaveMap_Response))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SaveMap_Response),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__SaveMap_Response__Sequence {
    pub data: *mut map_msgs__srv__SaveMap_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__SaveMap_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__SaveMap_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__SaveMap_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__SaveMap_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__SaveMap_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__SaveMap_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SaveMap_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SaveMap_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SaveMap_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__SetMapProjections_Request {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__SetMapProjections_Request() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__SetMapProjections_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__SetMapProjections_Request>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__SetMapProjections_Request)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__SetMapProjections_Request>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__SetMapProjections_Request)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SetMapProjections_Request),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__SetMapProjections_Request__Sequence {
    pub data: *mut map_msgs__srv__SetMapProjections_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__SetMapProjections_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__SetMapProjections_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__SetMapProjections_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__SetMapProjections_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__SetMapProjections_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__SetMapProjections_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SetMapProjections_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SetMapProjections_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SetMapProjections_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__SetMapProjections_Response {
    pub projected_maps_info: map_msgs__msg__ProjectedMapInfo__Sequence,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__SetMapProjections_Response() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__SetMapProjections_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__SetMapProjections_Response>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__SetMapProjections_Response)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__SetMapProjections_Response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__SetMapProjections_Response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).projected_maps_info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SetMapProjections_Response),
            "::",
            stringify!(projected_maps_info)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct map_msgs__srv__SetMapProjections_Response__Sequence {
    pub data: *mut map_msgs__srv__SetMapProjections_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_map_msgs__srv__SetMapProjections_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<map_msgs__srv__SetMapProjections_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<map_msgs__srv__SetMapProjections_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(map_msgs__srv__SetMapProjections_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<map_msgs__srv__SetMapProjections_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(map_msgs__srv__SetMapProjections_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SetMapProjections_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SetMapProjections_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(map_msgs__srv__SetMapProjections_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct nav_msgs__msg__GridCells {
    pub header: std_msgs__msg__Header,
    pub cell_width: f32,
    pub cell_height: f32,
    pub cells: geometry_msgs__msg__Point__Sequence,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__GridCells() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__GridCells> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__GridCells>(),
        64usize,
        concat!("Size of: ", stringify!(nav_msgs__msg__GridCells))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__GridCells>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__msg__GridCells))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__GridCells),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cell_width) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__GridCells),
            "::",
            stringify!(cell_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cell_height) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__GridCells),
            "::",
            stringify!(cell_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cells) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__GridCells),
            "::",
            stringify!(cells)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__msg__GridCells__Sequence {
    pub data: *mut nav_msgs__msg__GridCells,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__GridCells__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__GridCells__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__GridCells__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(nav_msgs__msg__GridCells__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__GridCells__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__msg__GridCells__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__GridCells__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__GridCells__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__GridCells__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct nav_msgs__msg__Odometry {
    pub header: std_msgs__msg__Header,
    pub child_frame_id: rosidl_runtime_c__String,
    pub pose: geometry_msgs__msg__PoseWithCovariance,
    pub twist: geometry_msgs__msg__TwistWithCovariance,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__Odometry() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__Odometry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__Odometry>(),
        736usize,
        concat!("Size of: ", stringify!(nav_msgs__msg__Odometry))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__Odometry>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__msg__Odometry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Odometry),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).child_frame_id) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Odometry),
            "::",
            stringify!(child_frame_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Odometry),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).twist) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Odometry),
            "::",
            stringify!(twist)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__msg__Odometry__Sequence {
    pub data: *mut nav_msgs__msg__Odometry,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__Odometry__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__Odometry__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__Odometry__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(nav_msgs__msg__Odometry__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__Odometry__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__msg__Odometry__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Odometry__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Odometry__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Odometry__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct nav_msgs__msg__Path {
    pub header: std_msgs__msg__Header,
    pub poses: geometry_msgs__msg__PoseStamped__Sequence,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__Path() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__Path> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__Path>(),
        56usize,
        concat!("Size of: ", stringify!(nav_msgs__msg__Path))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__Path>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__msg__Path))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Path),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poses) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Path),
            "::",
            stringify!(poses)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__msg__Path__Sequence {
    pub data: *mut nav_msgs__msg__Path,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__msg__Path__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__msg__Path__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__msg__Path__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(nav_msgs__msg__Path__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__msg__Path__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__msg__Path__Sequence))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Path__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Path__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__msg__Path__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__srv__GetMap_Request {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__GetMap_Request() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__GetMap_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__GetMap_Request>(),
        1usize,
        concat!("Size of: ", stringify!(nav_msgs__srv__GetMap_Request))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__GetMap_Request>(),
        1usize,
        concat!("Alignment of ", stringify!(nav_msgs__srv__GetMap_Request))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).structure_needs_at_least_one_member) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetMap_Request),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__srv__GetMap_Request__Sequence {
    pub data: *mut nav_msgs__srv__GetMap_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__GetMap_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__GetMap_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__GetMap_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(nav_msgs__srv__GetMap_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__GetMap_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__srv__GetMap_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetMap_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetMap_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetMap_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct nav_msgs__srv__GetMap_Response {
    pub map: nav_msgs__msg__OccupancyGrid,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__GetMap_Response() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__GetMap_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__GetMap_Response>(),
        136usize,
        concat!("Size of: ", stringify!(nav_msgs__srv__GetMap_Response))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__GetMap_Response>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__srv__GetMap_Response))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetMap_Response),
            "::",
            stringify!(map)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__srv__GetMap_Response__Sequence {
    pub data: *mut nav_msgs__srv__GetMap_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__GetMap_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__GetMap_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__GetMap_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(nav_msgs__srv__GetMap_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__GetMap_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__srv__GetMap_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetMap_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetMap_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetMap_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct nav_msgs__srv__GetPlan_Request {
    pub start: geometry_msgs__msg__PoseStamped,
    pub goal: geometry_msgs__msg__PoseStamped,
    pub tolerance: f32,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__GetPlan_Request() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__GetPlan_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__GetPlan_Request>(),
        184usize,
        concat!("Size of: ", stringify!(nav_msgs__srv__GetPlan_Request))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__GetPlan_Request>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__srv__GetPlan_Request))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Request),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).goal) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Request),
            "::",
            stringify!(goal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tolerance) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Request),
            "::",
            stringify!(tolerance)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__srv__GetPlan_Request__Sequence {
    pub data: *mut nav_msgs__srv__GetPlan_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__GetPlan_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__GetPlan_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__GetPlan_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(nav_msgs__srv__GetPlan_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__GetPlan_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__srv__GetPlan_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Request__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Request__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct nav_msgs__srv__GetPlan_Response {
    pub plan: nav_msgs__msg__Path,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__GetPlan_Response() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__GetPlan_Response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__GetPlan_Response>(),
        56usize,
        concat!("Size of: ", stringify!(nav_msgs__srv__GetPlan_Response))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__GetPlan_Response>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__srv__GetPlan_Response))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plan) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Response),
            "::",
            stringify!(plan)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__srv__GetPlan_Response__Sequence {
    pub data: *mut nav_msgs__srv__GetPlan_Response,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__GetPlan_Response__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__GetPlan_Response__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__GetPlan_Response__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(nav_msgs__srv__GetPlan_Response__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__GetPlan_Response__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__srv__GetPlan_Response__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Response__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Response__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__GetPlan_Response__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
pub struct nav_msgs__srv__LoadMap_Request {
    pub map_url: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__LoadMap_Request() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__LoadMap_Request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__LoadMap_Request>(),
        24usize,
        concat!("Size of: ", stringify!(nav_msgs__srv__LoadMap_Request))
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__LoadMap_Request>(),
        8usize,
        concat!("Alignment of ", stringify!(nav_msgs__srv__LoadMap_Request))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map_url) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__LoadMap_Request),
            "::",
            stringify!(map_url)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct nav_msgs__srv__LoadMap_Request__Sequence {
    pub data: *mut nav_msgs__srv__LoadMap_Request,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_nav_msgs__srv__LoadMap_Request__Sequence() {
    const UNINIT: ::std::mem::MaybeUninit<nav_msgs__srv__LoadMap_Request__Sequence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nav_msgs__srv__LoadMap_Request__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(nav_msgs__srv__LoadMap_Request__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<nav_msgs__srv__LoadMap_Request__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nav_msgs__srv__LoadMap_Request__Sequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nav_msgs__srv__LoadMap_Request__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
